/* 
1. ახალი მესიჯი

მომხმარებელმა Facebook-ზე გაიარა ავტორიზაცია.

ჩვენი ამოცანაა პირველ რიგში მას მივესალმოთ ტექსტით “სალამი შემოგევლე”.
შემდეგ შევამოწმოთ, თუ მას ახალი(წაუკითხავი) მესიჯები აქვს, ეკრანზე დავუწეროთ “შენ გაქვს რამდენიმე წაუკითხავი მესიჯი”

ამისათვის გვაქვს მოცემული 1 ცვლადი:

Let newMessages (boolean) - აქვს თუ არა მომხმარებელს ახალი მესიჯები
*/

console.log("სალამი შემოგევლე");
let newMessages = 5;

if (newMessages) {
    console.log("შენ გაქვს რამდენიმე წაუკითხავი მესიჯი");
}

/*
2. ონლაინ მაღაზია

მომხმარებელს ვებსაიტზე სურს პროდუქციის შეძენა, მოცემული გვაქვს შემდეგი ცვლადები:

Let userBalance (number) - მომხმარებლის ბალანსი
Let cartTotal (number) - მომხმარებლის მიერ არჩეული პროდუქციის ჯამი

მოხმმარებელმა დააჭირა ყიდვის ღილაკს. გამოთვალეთ მოხდა თუ არა წარმატებით გადახდა და ეკრანზე გამოიტანეთ შესაბამისი ტექსტი:

“გადახდა წარმატებით შესრულდა”
ან
“თქვენ არ გაქვთ საკმარისი თანხა”
*/

let userBalance = 50;
let cartTotal = 30;

if (userBalance >= cartTotal) {
    console.log("გადახდა წარმატებით შესრულდა");
} else {
    console.log("თქვენ არ გაქვთ საკმარისი თანხა");
}

/*
3. სტუდენტი გამოცდაზე

სტუდენტმა წერა გამოცდა და მიიღო ქულა, რომელსაც ვინახავთ ცვლადში:

Let testScore (number)

სტუდენტს აქვს რამდენიმე შანსი:

1. თუ მან გადალახა 95 ქულიანი ზღვარი, ის მოხვდება ნოვატორში
2. თუ მან გადალახა 70 ქულიანი ზღვარი, ის მოხვდება კემბრიჯის უნივერსიტეტში
3. თუ მან გადალახა 50 ქულიანი ზღვარი, ის რა თქმა უნდა მოხვდება გეპეიში.

გამოთვალეთ სად მოხვდა სტუდენტი და წერილობით მიულოცეთ ან თაუნგრძენით მას.
 */

let testScore =100;

if (testScore > 95) {
    console.log ("თქვენ ისწავლით ნოვატორში");
}  else if (testScore > 70 && testScore <= 95) {
    console.log ("თქვენ ისწავლით კემბრიჯის უნივერსიტეტში");
} else if (testScore > 50 && testScore <= 70) {
    console.log ("თქვენ ისწავლით გეპეიში");
} else {
    console.log ("დაკლიკე და ჩააბარე სულხან კვერნაძეში");
}

/*
4. ფასდაკლებების სისტემა

ვებსაიტზე გვაქვს რამდენიმე ტიპის ფასდაკლება, ისინი ასახულია რამდენიმე ცვლადში:

Let adminSale (number) - რამდენ ლარიანი ფასდაკლება ეკუთვნის ადმინისტრატორს
Let frequentClientSale (number) - რამდენ ლარიანი ფასდაკლება ეკუთვნის ვებსაიტის ხშირ კლიენტს
Let studentSale (number) - რამდენ ლარიანი ფასდაკლება ეკუთვნის სტუდენტს


მომხმარებელს სურს პროდუქციის შეძენა, ამ პროცესის ასასახად გვაქვს შემდეგი ცვლადები:

Let userBalance (number) - მომხმარებლის ბალანსი
Let cartTotal (number) - მომხმარებლის მიერ არჩეული პროდუქციის ჯამი

Let userIsAdmin (boolean) - არის თუ არა მომხმარებელი ადმინი
Let userIsFrequentClient (boolean) - არის თუ არა მომხმარებელი ხშირი კლიენტი
Let userIsStudent (boolean) - არის თუ არა მომხმარებელი სტუდენტი

მოხმმარებელმა დააჭირა ყიდვის ღილაკს. გამოთვალეთ მოხდა თუ არა წარმატებით გადახდა და ეკრანზე გამოიტანეთ შესაბამისი ტექსტი:

“გადახდა წარმატებით შესრულდა”
ან
“თქვენ არ გაქვთ საკმარისი თანხა”
 */

let userBalance2 = 1000;
let cartTotal2 = 800;

let adminSale = cartTotal2 * 0.2; // 20% ფასდაკლება
let frequentClientSale = cartTotal2 * 0.25 // 25% ფასდაკლება
let studentSale = cartTotal2 * 0.5 // 50% ფასდაკლება

let userIsAdmin = false;
let userIsFrequentClient = true;
let userIsStudent = false;

if (userBalance2 >= cartTotal2 && userIsAdmin) {
    console.log(`გადახდა წარმატებით შესრულდა - გადახდილი თანხა ${cartTotal2 - adminSale} - ფასდაკლება ${adminSale}`);
} else if (userBalance2 >= cartTotal2 && userIsFrequentClient) {
    console.log(`გადახდა წარმატებით შესრულდა - გადახდილი თანხა ${cartTotal2 - frequentClientSale} - ფასდაკლება ${frequentClientSale}`);
} else if (userBalance2 >= cartTotal2 && userIsStudent) {
    console.log(`გადახდა წარმატებით შესრულდა - გადახდილი თანხა ${cartTotal2 - studentSale} - ფასდაკლება ${studentSale}`);
} else {
    console.log(`თქვენ არ გაქვთ საკმარისი თანხა`);
}

/*
5. თბილისი - ბათუმი

მანქანა მიდის თბილისიდან ბათუმში,  მოცემული გვაქვს შემდეგი პირობა:

Let fuel (number) - რამდენი ლიტრი საწვავი აქვს მანქანას

მანქანის წვის მიხედვით:
1. იგოეთამდე დაჭირდება 10 ლიტრი საწვავი
2. გორამდე დაჭირდება 20 ლიტრი საწვავი
3. ხაშურამდე დაჭირდება 30 ლიტრი საწვავი
4. ქუთაისამდე დაჭირდება 50 ლიტრი საწვავი
5. ბათუმამდე დაჭირდება 80 ლიტრი საწვავი

გამოიანგარიშეთ სადამდე შეძლებს მანქანა ჩაღწევას და მძღოლს ეკრანზე გამოუტანეთ შედეგი ტექსტის სახით. 

მაგალითად:
“ამ წვეთებით იგოეთამდე თუ მოახერხებ ჩაგორებას ჩემო ძმაო”
 */
/*
6. თბილისი - ბათუმი - თბილისი

დამატებით გამოიანგარიშეთ ბათუმში ჩასულს, უკანა გზაზე რამდენს გაწვდება ჩვენი საწვავი და მძღოლს ეკრანზე გამოუტანეთ შედეგი ტექსტის სახით.
 */

let fuel = 120;
let fuelInBatumi = fuel - 80;

if ( fuel >= 80) {
    console.log ("თქვენ გაქვთ საკმარისი საწვავი ბათუმში ჩასასვლელად");
    if (fuelInBatumi >= 80) {
        console.log("თქვენ გაქვთ საკმარისი საწვავი ბათუმიდან თბილისში დასაბრუნებლად")
    } else if (fuelInBatumi >= 70 && fuelInBatumi < 80) {
        console.log("თქვენ გაქვთ საკმარისი საწვავი ბათუმიდან იგოეთში ჩასასვლელად")
    } else if (fuelInBatumi >= 60 && fuelInBatumi < 70) {
        console.log("თქვენ გაქვთ საკმარისი საწვავი ბათუმიდან გორში ჩასასვლელად")
    } else if (fuelInBatumi >= 50 && fuelInBatumi < 60) {
        console.log("თქვენ გაქვთ საკმარისი საწვავი ბათუმიდან ხაშურამდე ჩასასვლელად")
    } else if (fuelInBatumi >= 30 && fuelInBatumi < 50) {
        console.log("თქვენ გაქვთ საკმარისი საწვავი ბათუმიდან ქუთაისამდე ჩასასვლელად")
    } else {
        console.log("თქვენ არ გაქვთ უკან დასაბრუნებლად საკმარისი საწვავი")
    }
    
} else if (fuel >= 50 && fuel < 80) {
    console.log("საწვავი მხოლოდ ქუთაისამდე გეყოფათ");
} else if ( fuel >=30 && fuel < 50) {
    console.log("საწვავი მხოლოდ ხაშურამდე გეყოფათ");
}   else if ( fuel >=20 && fuel < 30) {
    console.log("საწვავი მხოლოდ გორამდე გეყოფათ");
} else if ( fuel >=10 && fuel < 20) {
    console.log("საწვავი მხოლოდ იგოეთამდე გეყოფათ");
} else {
    console.log("ეწვიეთ უახლოეს ბენზინ გასამართ სადგურს");
}

